Repository: baskar-yahoo/family-tree-sso
Catalog: resources/lang/*.po
Languages: ca, da, de, es

source: The administrator might have disabled to change some of the received user data
ca: És possible que l'administrador hagi inhabilitat canviar algunes de les dades d'usuari rebudes
da: Administratoren kan have deaktiveret muligheden for at ændre nogle af de modtagne brugerdata
de: Der Administrator hat möglicherweise die Änderung einiger der empfangenen Benutzerdaten deaktiviert
es: El administrador podría haber deshabilitado para cambiar algunos de los datos de usuario recibidos

source: Further registration data - Please complete and continue
ca: Més dades de registre: completeu i continueu
da: Yderligere registreringsdata - Udfyld venligst og fortsæt
de: Weitere Registrierungsdaten - Bitte vervollständigen und fortsetzen
es: Otros datos de registro - Rellene y continúe

source: Request a new account with
ca: Sol·liciteu un compte nou amb
da: Anmod om en ny konto med
de: Neues Benutzerkonto anfragen mit
es: Solicitar una nueva cuenta con

source: Control panel
ca: Panell de control
da: Kontrolpanel
de: Verwaltung
es: Panel de control

source: Currently, webtrees does not use the HTTPS protocol. If signing in with authorization providers, it is urgently recommended to use HTTPS in order to encrypt the communication with the authorization provider. If your server supports the protocol, HTTPS can be activated by changing "base_url" in the webtrees "config.ini.php" file. Currently, "base_url" does not start with "https://".
ca: Actualment, webtrees no utilitza el protocol HTTPS. Si inicieu sessió amb proveïdors d'autorització, es recomana urgentment utilitzar HTTPS per xifrar la comunicació amb el proveïdor d'autorització. Si el vostre servidor admet el protocol, HTTPS es pot activar canviant "base_url" al fitxer "config.ini.php" dels arbres web. Actualment, "base_url" no comença per "https://".
da: I øjeblikket bruger webtrees ikke HTTPS-protokollen. Hvis du logger ind med autorisationsudbydere, anbefales det kraftigt at bruge HTTPS for at kryptere kommunikationen med autorisationsudbyderen. Hvis din server understøtter protokollen, kan HTTPS aktiveres ved at ændre "base_url" i webtrees "config.ini.php"-filen. I øjeblikket starter "base_url" ikke med "https://".
de: Webtrees nutzt aktuell kein HTTPS-Protokoll. Beim Einloggen mit Autorisierungsanbietern wird dringend empfohlen, HTTPS zu nutzen, um die Kommunikation mit dem Autorisierungsanbieter zu verschlüsseln. Wenn Ihr Server das Protokoll unterstützt, kann HTTPS durch Ändern von "base_url" in der webtrees-Datei "config.ini.php" aktiviert werden. Aktuell startet "base_url" nicht mit "https://".
es: Actualmente, webtrees no utiliza el protocolo HTTPS. Si se registra con proveedores de autorización, se recomienda encarecidamente utilizar HTTPS para cifrar la comunicación con el proveedor de autorización. Si su servidor soporta el protocolo, HTTPS puede ser activado cambiando "base_url" en el archivo "config.ini.php" de webtrees. Actualmente, "base_url" no empieza por "https://".

source: Settings for Sign In Menus
ca: Configuració dels menús d'inici de sessió
da: Indstillinger for login-menuer
de: Einstellungen für Anmelde-Menüs
es: Configuración de los menús de inicio de sesión

source: Currently, the webtrees sign in with Username/Password is deactivated.
ca: Actualment, l'inici de sessió a WebTrees amb nom d'usuari/contrasenya està desactivat.
de: Derzeit ist die webtrees-Anmeldung mit Benutzername/Passwort deaktiviert.
es: Actualmente, el inicio de sesión en webtrees con nombre de usuario y contraseña está desactivado.

source: Therefore, it is only possible to sign in with an authorization provider. Please be sure to establish a webtrees administrator account with an authorization provider. Otherwise, administrator sign in might not be possible any more.
ca: Per tant, només és possible iniciar la sessió amb un proveïdor d'autoritzacions. Assegureu-vos d'establir un compte d'administrador de WebTrees amb un proveïdor d'autoritzacions. En cas contrari, és possible que l'inici de sessió de l'administrador ja no sigui possible.
de: Daher ist die Anmeldung nur mit einem Autorisierungsanbieter möglich. Bitte richten Sie unbedingt ein webtrees-Administratorkonto bei einem Autorisierungsanbieter ein. Andernfalls ist die Anmeldung als Administrator möglicherweise nicht mehr möglich.
es: Por lo tanto, solo es posible iniciar sesión con un proveedor de autorización. Asegúrese de crear una cuenta de administrador de WebTrees con un proveedor de autorización. De lo contrario, es posible que ya no sea posible iniciar sesión como administrador.

source: Currently, all menus to directly sign in with a webtrees Username/Password are deactivated.
ca: Actualment, tots els menús per iniciar sessió directament amb un nom d'usuari/contrasenya de WebTrees estan desactivats.
de: Derzeit sind alle Menüs zur direkten Anmeldung mit einem webtrees-Benutzernamen/Passwort deaktiviert.
es: Actualmente, todos los menús para iniciar sesión directamente con un nombre de usuario y contraseña de webtrees están desactivados.

source: Currently, the webtrees sign in menu is deactivated and the custom module sign in menu is hidden for the following trees: %s. Some of the users will not be able to sign in. Please consider to activate one of the sign in menus with the settings below.
ca: Actualment, el menú d'inici de sessió dels arbres web està desactivat i el menú d'inici de sessió del mòdul personalitzat està amagat per als arbres següents: %s. Alguns dels usuaris no podran iniciar la sessió. Penseu en activar un dels menús d'inici de sessió amb la configuració següent.
da: I øjeblikket er webtrees-login-menuen deaktiveret, og den brugerdefinerede modul-login-menu er skjult for følgende træer: %s. Nogle af brugerne vil ikke kunne logge ind. Overvej venligst at aktivere en af login-menuerne med indstillingerne nedenfor.
de: Aktuell ist das webtrees Anmelde-Menü deaktiviert und das modulspezifische Anmelde-Menü wird für die folgenden Stammbäume nicht angezeigt: %s. Einige Anwender werden sich nicht anmelden können. Bitte erwägen Sie, eines der Anmelde-Menüs mit den untenstehenden Einstellungen zu aktivieren.
es: Actualmente, el menú de inicio de sesión de webtrees está desactivado y el menú de inicio de sesión del módulo personalizado está oculto para los siguientes árboles: %s. Algunos usuarios no podrán iniciar sesión. Por favor, considere la posibilidad de activar uno de los menús de inicio de sesión con la configuración de abajo.

source: Show original webtrees sign in as menu item
ca: Mostra els arbres web originals per iniciar la sessió com a element de menú
da: Vis oprindeligt webtrees-login som menuobjekt
de: Menü-Eintrag für das ursprüngliche webtrees Anmelde-Menü anzeigen
es: Mostrar el inicio de sesión original de webtrees como opción de menú

source: By selecting/unselecting this option, it is possible to activate/deactivate the sign in menu entry for webtrees. If deactivated, only sign in menu entries for authorization providers might be shown.
ca: Si seleccioneu/desseleccioneu aquesta opció, és possible activar/desactivar l'entrada del menú d'inici de sessió per als arbres web. Si està desactivat, només es poden mostrar les entrades del menú d'inici de sessió per als proveïdors d'autorització.
da: Ved at vælge/fravælge denne mulighed kan du aktivere/deaktivere login-menuindgangen. Hvis den deaktiveres, vises der kun login-menuindgange for autorisationsudbydere.
de: Durch Auswählen/Abwählen dieser Auswahloption ist es möglich, den Menüeintrag für webtrees im Anmeldemenü zu aktivieren/deaktivieren. Falls deaktiviert, werden ggfs. nur Menüeinträge für Autorisierungsanbieter angezeigt.
es: Seleccionando/deseleccionando esta opción, es posible activar/desactivar la entrada del menú de inicio de sesión para webtrees. Si se desactiva, es posible que sólo se muestren las entradas del menú de inicio de sesión para los proveedores de autorización.

source: Hide the webtrees sign in menu
ca: Amaga el menú d'inici de sessió dels arbres web
da: Skjul webtrees-login-menuen
de: Das webtrees Anmelde-Menü verbergen
es: Ocultar el menú de inicio de sesión de webtrees

source: Hide
ca: Amaga
da: Skjul
de: Verbergen
es: Ocultar

source: By selecting this option, it is possible to hide the original webtrees sign in menu. This might be helpful if the custom module specific top menu for sign in is used instead.
ca: En seleccionar aquesta opció, és possible amagar el menú d'inici de sessió dels arbres web originals. Això pot ser útil si s'utilitza el menú superior específic del mòdul personalitzat per iniciar la sessió.
da: Ved at vælge denne mulighed kan du skjule den oprindelige login-menu. Dette kan være nyttigt, hvis det brugerdefinerede modul-specifikke topmenu til login bruges i stedet.
de: Durch Auswahl dieser Option ist es möglich, das ursprüngliche Anmelde-Menü von webtrees auszublenden. Dies kann hilfreich sein, wenn stattdessen das modulspezifische Menü für die Anmeldung verwendet wird.
es: Seleccionando esta opción, es posible ocultar el menú de inicio de sesión original de webtrees. Esto puede ser útil si en su lugar se utiliza el menú superior específico del módulo personalizado para el inicio de sesión.

source: Hide webtrees sign in (with Username/Password) on login page
ca: Amaga l'inici de sessió de webtrees (amb nom d'usuari/contrasenya) a la pàgina d'inici de sessió
de: Die webtrees-Anmeldung (mit Benutzername/Passwort) auf der Anmeldeseite verbergen
es: Ocultar el inicio de sesión de Webtrees (con nombre de usuario y contraseña) en la página de inicio de sesión

source: By selecting this option, it is possible to hide the webtrees sign in (with Username/Password) on the login page.
ca: Si seleccioneu aquesta opció, és possible ocultar l'inici de sessió de webtrees (amb nom d'usuari/contrasenya) a la pàgina d'inici de sessió.
de: Durch Auswahl dieser Option ist es möglich, die webtrees-Anmeldung (mit Benutzername/Passwort) auf der Anmeldeseite auszublenden.
es: Al seleccionar esta opción, es posible ocultar el inicio de sesión de webtrees (con nombre de usuario/contraseña) en la página de inicio de sesión.

source: Settings for Password, Email, and Connection Management
ca: Configuració per a la gestió de contrasenyes, correu electrònic i connexió
da: Indstillinger for adgangskode, email og forbindelseshåndtering
de: Einstellungen für die Passwort-/Email-Verwaltung und Verknüpfungen
es: Configuración de la gestión de contraseñas, correo electrónico y conexiones

source: Keep email address synchronized with authorization provider
ca: Mantenir l'adreça de correu electrònic sincronitzada amb el proveïdor d'autorització
da: Hold emailadressen synkroniseret med autorisationsudbyderen
de: E-Mail Adresse mit dem Autorisierungsanbieter synchron halten
es: Mantener la dirección de correo electrónico sincronizada con el proveedor de autorización

source: Keep synchronized
ca: Mantenir sincronitzat
da: Hold synkroniseret
de: Synchron halten
es: Mantener sincronizado

source: This selection prevents a user with the same email address in webtrees and at the authorization provider from changing the email address in webtrees. If the email address at the authorization provider changes, the email address in webtrees will be updated during sign in. If the administrator changes the email address in the webtrees user management, the email address synchronization will no longer continue.
ca: Aquesta selecció evita que un usuari amb la mateixa adreça de correu electrònic als arbres web i al proveïdor d'autorització pugui canviar l'adreça de correu electrònic als arbres web. Si l'adreça de correu electrònic del proveïdor d'autorització canvia, l'adreça de correu electrònic dels arbres web s'actualitzarà durant la sessió. Si l'administrador canvia l'adreça de correu electrònic a la gestió d'usuaris de l'arbre web, la sincronització de l'adreça electrònica deixarà de continuar.
da: Denne mulighed forhindrer en bruger med samme emailadresse i webtrees og hos autorisationsudbyderen i at ændre emailadressen i webtrees. Hvis emailadressen hos autorisationsudbyderen ændres, vil emailadressen i webtrees blive opdateret under login. Hvis administratoren ændrer emailadressen i webtrees' brugerstyring, vil email-synkroniseringen ikke fortsætte.
de: Diese Auswahl verhindert, dass ein Benutzer mit derselben E-Mail-Adresse in webtrees und beim Autorisierungsanbieter die E-Mail-Adresse in webtrees ändern kann. Sollte sich die E-Mail-Adresse beim Autorisierungsanbieter ändern, wird die E-Mail-Adresse in webtrees beim Anmelden aktualisiert. Wenn der Administrator die E-Mail-Adresse in der webtrees-Benutzerverwaltung ändert, wird die Synchronisierung der E-Mail-Adresse nicht mehr weitergeführt.
es: Esta selección impide que un usuario con la misma dirección de correo electrónico en webtrees y en el proveedor de autorización cambie la dirección de correo electrónico en webtrees. Si la dirección de correo electrónico en el proveedor de autorización cambia, la dirección de correo electrónico en webtrees se actualizará durante el inicio de sesión. Si el administrador cambia la dirección de correo electrónico en la gestión de usuarios de webtrees, la sincronización de direcciones de correo electrónico ya no continuará.

source: Use webtrees password in parallel
ca: Utilitzeu la contrasenya dels arbres web en paral·lel
da: Brug webtrees-adgangskode parallelt
de: Ein webtrees-Passwort parallel benutzen
es: Utilizar la contraseña webtrees en paralelo

source: This option allows users, who register with an authorization provider, to additionally sign in with a webtrees password.
ca: Aquesta opció permet als usuaris, que es registren amb un proveïdor d'autorització, iniciar sessió addicionalment amb una contrasenya d'arbres web.
da: Denne mulighed giver brugere, der registrerer sig med en autorisationsudbyder, mulighed for også at logge ind med en adgangskode.
de: Diese Auswahl ermöglicht es Benutzern, die sich mit einem Autorisierungsanbieter registrieren, sich zusätzlich mit einem webtrees-Passwort anzumelden.
es: Esta opción permite a los usuarios, que se registran con un proveedor de autorización, iniciar sesión adicionalmente con una contraseña de webtrees.

source: Allow existing webtrees users to connect with an authorization provider
ca: Permet que els usuaris d'arbres web existents es connectin amb un proveïdor d'autorització
da: Tillad eksisterende webtrees-brugere at forbinde med en autorisationsudbyder
de: Bestehenden webtrees-Benutzern erlauben, sich mit einem Autorisierungsanbieter zu verbinden
es: Permitir a los usuarios existentes de webtrees conectarse con un proveedor de autorización

source: If selecting this option, an existing webtrees user can connect the webtrees account with an authorization provider. This will allow users to additionally sign in with an authorization providers while still using the webtrees user and password.
ca: Si seleccioneu aquesta opció, un usuari de webtrees existent pot connectar el compte de webtrees amb un proveïdor d'autorització. Això permetrà als usuaris iniciar la sessió addicionalment amb un proveïdor d'autorització mentre encara utilitzen l'usuari i la contrasenya dels arbres web.
da: Hvis denne mulighed vælges, kan en eksisterende bruger forbinde med en autorisationsudbyder. Dette vil give brugeren mulighed for at logge ind med en autorisationsudbyder samtidig med, at webtrees-brugeren og -adgangskoden stadig kan bruges.
de: Wenn Sie diese Option auswählen, kann ein bestehender webtrees-Benutzer das webtrees-Konto mit einem Autorisierungsanbieter verbinden. Dadurch können sich Benutzer zusätzlich mit einem Autorisierungsanbieter anmelden und dabei weiterhin den webtrees-Benutzernamen und das Passwort verwenden.
es: Si selecciona esta opción, un usuario existente de webtrees puede conectar la cuenta de webtrees con un proveedor de autorización. Esto permitirá a los usuarios iniciar sesión adicionalmente con un proveedor de autorización sin dejar de utilizar el usuario y la contraseña de webtrees.

source: Debug Settings
ca: Configuració de depuració
da: Fejlsøgningsindstillinger
de: Debug-Einstellungen
es: Configuración de depuración

source: Debug logs
ca: Registres de depuració
da: Fejlsøgningslogs
de: Debug-Logeinträge
es: Registros de depuración

source: By selecting this option, additional debug information about the protocol flow between webtrees and the authorization provider will be logged in the webtrees website logs.
ca: En seleccionar aquesta opció, la informació de depuració addicional sobre el flux del protocol entre webtrees i el proveïdor d'autorització es registrarà als registres del lloc web de webtrees.
da: Ved at vælge denne mulighed vil yderligere fejlinformation om forbindelsen mellem webtrees og autorisationsudbyderen blive logget i logfilerne.
de: Wenn Sie diese Option auswählen, werden zusätzliche Debug-Informationen über den Protokollfluss zwischen webtrees und dem Autorisierungsanbieter in den Website-Logs von webtrees protokolliert.
es: Al seleccionar esta opción, se registrará información de depuración adicional sobre el flujo del protocolo entre webtrees y el proveedor de autorización en los registros del sitio web de webtrees.

source: Error while trying to get an access token from the authorization provider. Check the setting for urlAccessToken in the webtrees configuration. Check the server access logs (or .htaccess configuration files) whether any 301 or 302 redirects are applied, which might convert POST into GET requests.
da: Fejl ved forsøg på at hente et adgangstoken fra autorisationsudbyderen. Tjek indstillingen for urlAccessToken i webtrees-konfigurationen. Tjek serverens adgangslogfiler (eller .htaccess-konfigurationsfiler) for at se, om der anvendes 301- eller 302-redirects, som kan omdanne POST-anmodninger til GET-anmodninger.

source: Automatic user registration after sign in with authorization provider
da: Automatisk brugerregistrering efter login med autorisationsudbyder

source: Password (within webtrees)
da: Adgangskode (inde i webtrees)

source: Currently, all menus to directly sign in with webtrees are deactivated. Therefore, only sign in with authorization providers is possible. Please be sure that you establish a webtrees administrator account with an authorization provider. Otherwise, administrator sign in is not possible any more. Hint: You can still access the original webtrees login page by typing the login route into the browser line, e.g.:
da: I øjeblikket er alle menuer til direkte login deaktiveret. Derfor er det kun muligt at logge ind med autorisationsudbydere. Sørg venligst for, at du opretter en webtrees-administrator-konto med en autorisationsudbyder. Ellers vil administrator-login ikke være muligt længere. Tip: Du kan stadig få adgang til den oprindelige webtrees-login-side ved at indtaste login-adressen i browserens adressefelt, f.eks.:
