Repository: baskar-yahoo/family-tree-sso
Catalog: resources/lang/*.po
Languages: ca, da, de, es

source: The configuration for the authorization provider "%s" does not include data for the option "%s". Please check the configuration in the following file: data/config.ini.php
ca: La configuració del proveïdor d'autorització "%s" no inclou dades per a l'opció "%s". Si us plau, comproveu la configuració en el següent fitxer: data/config.ini.php
da: Konfigurationen for autorisationsudbyderen "%s" inkluderer ikke data for indstillingen "%s". Tjek venligst konfigurationen i følgende fil: data/config.ini.php
de: Die Konfiguration für den Authorisierungsanbieter "%s" enthält keine Angaben für die Option "%s". Bitte prüfen Sie die Konfiguration in der folgenden Datei: data/config.ini.php
es: La configuración para el proveedor de autorización "%s" no incluye datos para la opción "%s". Compruebe la configuración en el siguiente archivo: data/config.ini.php

source: The requested authorization provider could not be found
ca: No s'ha pogut trobar el proveïdor d'autorització sol·licitat
da: Den anmodede autorisationsudbyder kunne ikke findes
de: Der angeforderte Autorisierungsanbieter konnte nicht gefunden werden
es: No se ha encontrado el proveedor de autorización solicitado

source: Disconnected the user %s from provider: %s
ca: S'ha desconnectat l'usuari %s del proveïdor: %s
da: Brugeren %s blev afbrudt fra udbyderen: %s
de: Die Verknüpfung von Benutzer %s mit Autorisierungsanbieter %s wurde gelöst
es: Desconectado el usuario %s del proveedor: %s

source: Failed security check: A user, who is currently not signed in, requested to connect an authorization provider with the current user.
ca: Comprovació de seguretat fallida: un usuari, que actualment no té la sessió iniciada, ha sol·licitat connectar un proveïdor d'autorització amb l'usuari actual.
da: Fejlet sikkerhedstjek: En bruger, der ikke er logget ind, forsøgte at forbinde en autorisationsudbyder med brugeren.
de: Fehlgeschlagene Sicherheitsüberprüfung: Ein Benutzer, der derzeit nicht angemeldet ist, hat angefordert, einen Autorisierungsanbieter mit dem aktuellen Benutzer zu verbinden.
es: Comprobación de seguridad fallida: Un usuario, que actualmente no ha iniciado sesión, solicitó conectar un proveedor de autorización con el usuario actual.

source: Timeout for connecting user %s with authorization provider %s. Please restart connecting with the authorization provider.
ca: Temps d'espera per connectar l'usuari %s amb el proveïdor d'autorització %s. Reinicieu la connexió amb el proveïdor d'autorització.
da: Det tog for lang tid at forbinde bruger %s med autorisationsudbyderen %s. Forsøg venligst igen.
de: Zeitüberschreitung beim Verknüpfen des Benutzers %s mit dem Autorisierungsanbieter %s. Bitte starten Sie die Verknüpfung mit dem Autorisierungsanbieter neu.
es: Tiempo de espera para la conexión del usuario %s con el proveedor de autorización %s. Por favor, reinicie la conexión con el proveedor de autorización.

source: OAuth 2.0 communication error
ca: Error de comunicació OAuth 2.0
da: OAuth 2.0 kommunikationsfejl
de: OAuth 2.0 Kommunikationsfehler
es: Error de comunicación OAuth 2.0

source: Invalid state in communication with authorization provider.
ca: Estat no vàlid en comunicació amb el proveïdor d'autorització.
da: Ugyldig kommunikationen med autorisationsudbyderen.
de: Ungültiger Zustand in der Kommunikation mit dem Autorisierungsanbieter.
es: Estado no válido en la comunicación con el proveedor de autorización.

source: Failed to get the access token or the user details from the authorization provider
ca: No s'ha pogut obtenir el testimoni d'accés o les dades de l'usuari del proveïdor d'autorització
da: Kunne ikke hente adgangstoken eller brugeroplysninger fra autorisationsudbyderen
de: Fehler beim Empfang des Zugriffs-Tokens oder der Benutzer-Daten vom Autorisierungsanbieter
es: No se ha podido obtener el token de acceso o los datos de usuario del proveedor de autorización

source: The identity received by the authorization provider cannot be connected to the requested user, because it is already used to sign in by another webtrees user.
ca: La identitat rebuda pel proveïdor d'autorització no es pot connectar amb l'usuari sol·licitat, perquè ja l'utilitza per iniciar la sessió un altre usuari de webtrees.
da: Den identitet, der er modtaget fra autorisationsudbyderen, kan ikke forbindes til den anmodede bruger, da den allerede er brugt af en anden webtrees-bruger.
de: Die vom Autorisierungsanbieter erhaltene Identität kann nicht mit dem angeforderten Benutzer verknüpft werden, da sie bereits von einem anderen webtrees-Benutzer für die Anmeldung verwendet wird.
es: La identidad recibida por el proveedor de autorización no puede conectarse con el usuario solicitado, porque ya ha sido utilizada para iniciar sesión por otro usuario de webtrees.

source: Sucessfully connected existing user %s with provider: %s
ca: S'ha connectat correctament l'usuari existent %s amb el proveïdor: %s
da: Bruger %s blev forbundet med udbyderen: %s
de: Erfolgreiche Verknüpfung des existierenden Benutzers %s mit Autorisierungsanbieter: %s
es: Conectado con éxito el usuario existente %s con el proveedor: %s

source: Currently, no webtrees user account is related to the user data received from the authorization provider.
ca: Actualment, cap compte d'usuari de webtrees està relacionat amb les dades d'usuari rebudes del proveïdor d'autorització.
da: Der er i øjeblikket ingen webtrees-brugere, der er knyttet til de brugerdata, der er modtaget fra autorisationsudbyderen.
de: Aktuell ist kein webtrees-Benutzer mit den vom Autorisierungsanbieter bereitgestellten Benutzerdaten verknüpft.
es: Actualmente, ninguna cuenta de usuario de webtrees está relacionada con los datos de usuario recibidos del proveedor de autorización.

source: It is not possible to request a webtrees account with %s.
ca: No és possible sol·licitar un compte de webtrees amb %s.
da: Det er ikke muligt at anmode om en webtrees-konto med %s.
de: Es ist nicht möglich, ein webtrees-Konto mit %s anzufordern.
es: No es posible solicitar una cuenta webtrees con %s.

source: To connect an existing user with %s, sign in and select: My pages / My account / Connect with
ca: Per connectar un usuari existent amb %s, inicieu la sessió i seleccioneu: Les meves pàgines / El meu compte / Connecta amb
da: For at forbinde en eksisterende bruger med %s, log ind og vælg: Mine sider / Min konto / Forbind med
de: Um einen bestehenden Benutzer mit %s zu verbinden, melden Sie sich an und wählen: Meine Seiten / Mein Konto / Verknüpfen mit
es: Para conectar un usuario existente con %s, inicie sesión y seleccione: Mis páginas / Mi cuenta / Conectar con

source: Invalid user data received from %s. Email or username missing.
ca: S'han rebut dades d'usuari no vàlides de %s. Falta el correu electrònic o el nom d'usuari.
da: Ugyldige brugerdata modtaget fra %s. Email eller brugernavn mangler.
de: Ungültige Benutzerdaten von %s empfangen. E-Mail oder Benutzername fehlt.
es: Datos de usuario no válidos recibidos de %s. Falta el correo electrónico o el nombre de usuario.

source: Requesting a new webtrees user account is currently not allowed.
ca: Actualment no es permet sol·licitar un nou compte d'usuari de webtrees.
da: Anmodning om en ny webtrees-bruger konto er i øjeblikket ikke tilladt.
de: Das Anfordern eines neuen webtrees-Benutzerkontos ist derzeit nicht erlaubt.
es: Actualmente no está permitido solicitar una nueva cuenta de usuario de webtrees.

source: Press "continue" to request a new webtrees user acccount with %s.
ca: Premeu "continua" per sol·licitar un nou compte d'usuari de l'arbre web amb %s.
da: Tryk på "Fortsæt" for at anmode om en ny webtrees-bruger konto med %s.
de: Klicken Sie auf „Weiter“, um ein neues webtrees-Benutzerkonto mit %s anzufordern.
es: Pulse "continuar" para solicitar una nueva cuenta de usuario webtrees con %s.

source: Request a new user account with an authorization provider
ca: Sol·liciteu un compte d'usuari nou amb un proveïdor d'autorització
da: Anmod om en ny brugerkonto med en autorisationsudbyder
de: Beantragen Sie ein neues Benutzerkonto mit einem Autorisierungsanbieter
es: Solicitar una nueva cuenta de usuario con un proveedor de autorización

source: The email address for user %s was updated to: %s
ca: L'adreça de correu electrònic de l'usuari %s s'ha actualitzat a: %s
da: Emailadressen for bruger %s blev opdateret til: %s
de: Die Email-Adresse für Benutzer %s wurde aktualisiert zu: %s
es: La dirección de correo electrónico del usuario %s se ha actualizado a: %s

source: Login denied. The email address or username already exists.
ca: Inici de sessió denegat. L'adreça de correu electrònic o el nom d'usuari ja existeix.
da: Login nægtet. Emailadressen eller brugernavnet findes allerede.
de: Anmeldung verweigert. Die E-Mail-Adresse oder der Benutzername ist bereits vorhanden.
es: Login denegado. La dirección de correo electrónico o el nombre de usuario ya existen.

source: OAuth2 Client
ca: Client OAuth2
da: OAuth2-klient
es: Cliente OAuth2

source: A custom module to implement a OAuth2 client for webtrees.
ca: Un mòdul personalitzat per implementar un client OAuth2 per als arbres web.
da: Et modul til at implementere en OAuth2-klient til webtrees.
de: Ein benutzerspezifisches Modul, welches einen OAuth2 Client für webtrees zur Verfügung stellt.
es: Un módulo personalizado para implementar un cliente OAuth2 para webtrees.

source: Sign in with
ca: Inicia sessió amb
da: Log ind med
de: Anmelden mit
es: Identifícate con

source: Disconnect account from
ca: Desconnecteu el compte de
da: Afkobl konto fra
de: Konto-Verknüpfung lösen von
es: Desconectar cuenta de

source: Connect account with
ca: Connecta el compte amb
da: Forbind konto med
de: Konto-Verknüpfung mit
es: Conectar la cuenta con

source: The preferences for the module "%s" were updated.
ca: S'han actualitzat les preferències del mòdul "%s".
da: Indstillingerne for modulet "%s" blev opdateret.
de: Die Einstellungen für das Modul "%s" wurden aktualisiert.
es: Se han actualizado las preferencias del módulo "%s".

source: The redirect URL for OAuth 2.0 communication has changed in custom module versions >= 1.1.0. If certain connections with authorization providers fail, you might need to update the authorization provider settings with the new redirect URL.
ca: L'URL de redirecció per a la comunicació OAuth 2.0 ha canviat en les versions de mòduls personalitzats >= 1.1.0. Si determinades connexions amb proveïdors d'autorització fallen, és possible que hàgiu d'actualitzar la configuració del proveïdor d'autorització amb el nou URL de redirecció.
da: Redirect-URL'en for OAuth 2.0 kommunikation er ændret i modulversioner >= 1.1.0. Hvis visse forbindelser med autorisationsudbydere fejler, skal du muligvis opdatere autorisationsudbyderens indstillinger med den nye redirect-URL.
de: Die Redirect-URL für die OAuth 2.0-Kommunikation hat sich in Modulversionen >= 1.1.0 geändert. Wenn bestimmte Verbindungen mit Autorisierungsanbietern fehlschlagen, müssen Sie möglicherweise die Einstellungen des Autorisierungsanbieters mit der neuen redirect-URL aktualisieren.
es: La URL de redirección para la comunicación OAuth 2.0 ha cambiado en las versiones del módulo personalizado >= 1.1.0. Si algunas conexiones con proveedores de autorización fallan, es posible que tenga que actualizar la configuración del proveedor de autorización con la nueva URL de redirección.

source: The preferences for the custom module "%s" were sucessfully updated to the new module version %s.
ca: Les preferències del mòdul personalitzat "%s" s'han actualitzat correctament a la nova versió del mòdul %s.
da: Indstillingerne for modulet "%s" blev succesfuldt opdateret til den nye modulversion %s.
de: Die Einstellungen für das benutzerdefinierte Modul "%s" wurden für die neue Modul-Version %s aktualisiert.
es: Las preferencias del módulo personalizado "%s" se han actualizado correctamente a la nueva versión del módulo %s.

source: The custom module "%s" is activated in parallel to the %s custom module. This can lead to unintended behavior. If using the %s module, it is strongly recommended to deactivate the "%s" module, because the identical functionality is also integrated in the %s module.
ca: El mòdul personalitzat "%s" s'activa en paral·lel al mòdul personalitzat %s. Això pot provocar un comportament no desitjat. Si s'utilitza el mòdul %s, és molt recomanable desactivar el mòdul "%s", perquè la funcionalitat idèntica també està integrada al mòdul %s.
da: Modulet "%s" er aktiveret parallelt med %s modulet. Dette kan føre til uønsket adfærd. Hvis du bruger %s modulet, anbefales det stærkt at deaktivere "%s" modulet, da den identiske funktionalitet også er integreret i %s modulet.
de: Das benutzerspezifische Modul "%s" ist parallel zum benutzerspezifische Modul %s aktiviert. Dies kann zu unbeabsichtigtem Verhalten führen. Bei Verwendung des Moduls %s wird dringend empfohlen, das Modul "%s" zu deaktivieren, weil die identische Funktion ebenfalls im Modul %s integriert ist.
es: El módulo personalizado "%s" se activa en paralelo al módulo personalizado %s. Esto puede dar lugar a comportamientos no deseados. Si utiliza el módulo %s, se recomienda encarecidamente desactivar el módulo "%s", ya que la funcionalidad idéntica también está integrada en el módulo %s.

source: The custom module "%s" is activated in parallel to the %s custom module. This can lead to unintended behavior, because both of the modules have registered the same custom view "%s". It is strongly recommended to deactivate one of the modules.
ca: El mòdul personalitzat "%s" s'activa en paral·lel al mòdul personalitzat %s. Això pot provocar un comportament no desitjat, perquè els dos mòduls han registrat la mateixa vista personalitzada "%s". És molt recomanable desactivar un dels mòduls.
da: Modulet "%s" er aktiveret parallelt med %s modulet. Dette kan føre til uforudsete problemer, da begge moduler har registreret den samme brugerdefinerede visning "%s". Det anbefales på det kraftigste at deaktivere et af modulerne.
de: Das benutzerspezifische Modul "%s" ist parallel zum benutzerspezifische Modul %s aktiviert. Dies kann zu unbeabsichtigtem Verhalten führen, weil beide Module die gleiche Custom View "%s" registriert haben. Es wird dringend empfohlen eines der beiden Module zu deaktivieren.
es: El módulo personalizado "%s" se activa en paralelo al módulo personalizado %s. Esto puede provocar un comportamiento no deseado, ya que ambos módulos han registrado la misma vista personalizada "%s". Se recomienda encarecidamente desactivar uno de los módulos.

source: The custom module view "%s" is not registered as replacement for the standard webtrees view. There might be another module installed, which registered the same custom view. This can lead to unintended behavior. It is strongly recommended to deactivate one of the modules. The path of the parallel view is: %s
ca: La vista del mòdul personalitzat "%s" no està registrada com a substitució de la vista estàndard dels arbres web. Pot ser que hi hagi un altre mòdul instal·lat, que enregistrés la mateixa vista personalitzada. Això pot provocar un comportament no desitjat. És molt recomanable desactivar un dels mòduls. El camí de la vista paral·lela és: %s
da: Modulvisningen "%s" er ikke registreret som erstatning for standard webtrees-visningen. Der kan være et andet modul installeret, som har registreret den samme visning. Dette kan føre til uønskede problemer. Det anbefales på det kraftigste at deaktivere et af modulerne. Stien til den parallelle visning er: %s
de: Der Custom View "%s" ist nicht als Ersatz für den Standard Custom View von webtrees registriert. Es könnte ein anderes Modul installiert sein, welches den gleiche Custom View registriert hat. Dies kann zu unerwartetem Verhalten führen. Es wird dringend empfohlen, eines der Module zu deaktivieren. Der Pfad für den Custom View ist: %s
es: La vista personalizada del módulo "%s" no está registrada como reemplazo de la vista estándar de webtrees. Puede que haya otro módulo instalado que haya registrado la misma vista personalizada. Esto puede provocar un comportamiento no deseado. Se recomienda encarecidamente desactivar uno de los módulos. La ruta de la vista paralela es: %s

source: Error while trying to get an access token from the authorization provider. Check the setting for urlAccessToken in the webtrees configuration. Check the server access logs for errors. Check the server configuration for redirects.
ca: Error en intentar obtenir un testimoni d'accés del proveïdor d'autorització. Comproveu la configuració d'urlAccessToken a la configuració de webtrees. Comproveu si hi ha errors als registres d'accés del servidor. Comproveu si hi ha redireccions a la configuració del servidor.
de: Beim Abrufen eines Zugriffstokens vom Autorisierungsanbieter ist ein Fehler aufgetreten. Überprüfen Sie die Einstellung für „urlAccessToken“ in der webtrees-Konfiguration. Überprüfen Sie die Serverzugriffsprotokolle auf Fehler. Überprüfen Sie die Serverkonfiguration auf Weiterleitungen.
es: Error al intentar obtener un token de acceso del proveedor de autorización. Verifique la configuración de urlAccessToken en la configuración de WebTrees. Revise los registros de acceso del servidor para detectar errores. Revise la configuración del servidor para detectar redirecciones.

source: Invalid user data received from the authorization provider
ca: Les dades d'usuari rebudes del proveïdor d'autorització no són vàlides
da: Ugyldige brugerdata modtaget fra autorisationsudbyderen
de: Ungültige Benutzerdaten vom Authorisierungsanbieter empfangen
es: Datos de usuario no válidos recibidos del proveedor de autorización

source: Check the setting for urlResourceOwnerDetails in the webtrees configuration.
ca: Comproveu la configuració d'urlResourceOwnerDetails a la configuració dels arbres web.
da: Tjek indstillingen for urlResourceOwnerDetails i webtrees-konfigurationen.
de: Prüfen Sie die Einstellung für urlResourceOwnerDetails in der webtrees Konfiguration.
es: Compruebe la configuración de urlResourceOwnerDetails en la configuración de webtrees.

source: Custom module
ca: Mòdul personalitzat
da: Brugerdefineret modul
de: Benutzerdefiniertes Modul
es: Módulo personalizado

source: The authorization provider "%s" is not available. Please contact the webtrees administrator.
ca: El proveïdor d'autorització "%s" no està disponible. Poseu-vos en contacte amb l'administrador de webtrees.
da: Autorisationsudbyderen "%s" er ikke tilgængelig. Kontakt venligst webtrees-administratoren.
es: El proveedor de autorización "%s" no está disponible. Póngase en contacto con el administrador de webtrees.

source: Signed in with %s
ca: S'ha iniciat la sessió amb %s
da: Logget ind med %s
de: Angemeldet mit %s
es: Registrado con %s

source: This user can sign in with %s
ca: Aquest usuari pot iniciar sessió amb %s
da: Denne bruger kan logge ind med %s
de: Dieser Benutzer kann sich mit %s anmelden
es: Este usuario puede iniciar sesión con %s

source: The administrator might have disabled to change the email address or the password
ca: És possible que l'administrador hagi inhabilitat canviar l'adreça de correu electrònic o la contrasenya
da: Administratoren kan have deaktiveret muligheden for at ændre emailadressen eller adgangskoden
de: Der Administrator hat möglicherweise die Änderung der E-Mail-Adresse oder des Passworts deaktiviert
es: El administrador podría haber desactivado para cambiar la dirección de correo electrónico o la contraseña

source: Request a new user account with
ca: Sol·liciteu un nou compte d'usuari amb
da: Anmod om en ny brugerkonto med
de: Neues Benutzerkonto anfragen mit
es: Solicitar una nueva cuenta de usuario con

source: Connect with
ca: Connecta amb
da: Forbind med
de: Verknüpfen mit
es: Conectar con

source: Disconnect from
ca: Desconnectar de
da: Afkobl
de: Verknüpfung lösen von
es: Desconectar de

source: Sign in with an authorization provider
ca: Inicieu la sessió amb un proveïdor d'autorització
da: Log ind med en autorisationsudbyder
de: Anmelden mit einem Autorisierungsanbieter
es: Iniciar sesión con un proveedor de autorización

source: In this view, you can only request a webtrees password. The authorization provider password is managed by the authorization provider and cannot be changed within webtrees.
ca: En aquesta vista, només podeu sol·licitar una contrasenya d'arbres web. La contrasenya del proveïdor d'autorització la gestiona el proveïdor d'autorització i no es pot canviar dins dels arbres web.
da: I denne visning kan du kun anmode om en webtrees-adgangskode. Adgangskoden til autorisationsudbyderen administreres af autorisationsudbyderen og kan ikke ændres inde i webtrees.
de: In dieser Ansicht können Sie nur ein webtrees-Passwort anfordern. Das Autorisierungsanbieter-Passwort wird vom Autorisierungsanbieter verwaltet und kann innerhalb von webtrees nicht geändert werden.
es: En esta vista, sólo se puede solicitar una contraseña de webtrees. La contraseña del proveedor de autorización la gestiona el proveedor de autorización y no se puede cambiar dentro de webtrees.

source: The request to reset the passwort belongs to a user, who can sign in with an authorization provider. In this view, you can only change the webtrees password. The authorization provider password is managed by the authorization provider and cannot be changed within webtrees.
ca: La sol·licitud per restablir la contrasenya pertany a un usuari, que pot iniciar sessió amb un proveïdor d'autorització. En aquesta vista, només podeu canviar la contrasenya dels arbres web. La contrasenya del proveïdor d'autorització la gestiona el proveïdor d'autorització i no es pot canviar dins dels arbres web.
da: Anmodningen om at nulstille adgangskoden tilhører en bruger, der kan logge ind med en autorisationsudbyder. I denne visning kan du kun ændre webtrees-adgangskoden. Adgangskoden til autorisationsudbyderen administreres af autorisationsudbyderen og kan ikke ændres inde i webtrees.
de: Die Anfrage zum Zurücksetzen des Passworts gehört zu einem Benutzer, der sich mit einem Autorisierungsanbieter anmelden kann. In dieser Ansicht können Sie nur das webtrees-Passwort ändern. Das Autorisierungsanbieter-Passwort wird vom Autorisierungsanbieter verwaltet und kann nicht innerhalb von webtrees geändert werden.
es: La solicitud para restablecer la contraseña pertenece a un usuario, que puede iniciar sesión con un proveedor de autorización. En esta vista, sólo se puede cambiar la contraseña de webtrees. La contraseña del proveedor de autorización es gestionada por el proveedor de autorización y no se puede cambiar dentro de webtrees.

source: Currently, the webtrees password cannot be reset for users, who sign in with an authorization provider. Please contact the webtrees administrator.
ca: Actualment, la contrasenya dels arbres web no es pot restablir per als usuaris, que inicien sessió amb un proveïdor d'autorització. Poseu-vos en contacte amb l'administrador de webtrees.
da: I øjeblikket kan webtrees-adgangskoden ikke nulstilles for brugere, der logger ind med en autorisationsudbyder. Kontakt venligst webtrees-administratoren.
de: Derzeit kann das webtrees-Passwort für Benutzer, die sich mit einem Autorisierungsanbieter anmelden, nicht zurückgesetzt werden. Bitte wenden Sie sich an den webtrees-Administrator.
es: Actualmente, la contraseña de webtrees no se puede restablecer para los usuarios que se registran con un proveedor de autorización. Póngase en contacto con el administrador de webtrees.

source: Request account with
ca: Sol·licitar compte amb
da: Anmod om konto med
de: Benutzerkonto anfragen mit
es: Solicitar cuenta con
